---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetAnalyticalSpace
source: html/c9373502-fff8-00f8-0d29-10f2cce6d2ea.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetAnalyticalSpace Method

Gets the primary analytical space this surface is associated with.

## Syntax (C#)
```csharp
public EnergyAnalysisSpace GetAnalyticalSpace()
```

## Returns
The primary analytical space.